abstractsig/io_nrf52840/io_cpu.h
/*
 *
 * io nrf52840 cpu
 *
 */
#ifndef io_cpu_H_
#define io_cpu_H_
#include <io_core.h>
#include <nrf/nrf52840.h>
#include <nrf/nrf52840_bitfields.h>

typedef struct PACK_STRUCTURE nrf_time_clock {

	NRF_TIMER_Type *high_timer;
	NRF_TIMER_Type *low_timer;	
	IRQn_Type interrupt_number;
	uint32_t ppi_channel;

	io_event_t alarm;
	io_t *io;
	
} nrf_64bit_time_clock_t;

void	start_nrf_time_clock (io_t*,nrf_64bit_time_clock_t*);

#define NRF52840_IO_CPU_STRUCT_MEMBERS \
	IO_STRUCT_MEMBERS				\
	io_value_memory_t *vm;\
	io_byte_memory_t *bm;\
	uint32_t in_event_thread;\
	io_value_pipe_t *tasks;\
	nrf_64bit_time_clock_t tc;\
	uint32_t prbs_state[4]; \
	uint32_t first_run;\
	/**/

typedef struct PACK_STRUCTURE nrf52840_io {
	NRF52840_IO_CPU_STRUCT_MEMBERS
} nrf52840_io_t;

void	initialise_cpu_io (io_t*);

#define NUMBER_OF_ARM_INTERRUPT_VECTORS	16L
#define NUMBER_OF_NRF_INTERRUPT_VECTORS	47L
#define NUMBER_OF_INTERRUPT_VECTORS	(NUMBER_OF_ARM_INTERRUPT_VECTORS + NUMBER_OF_NRF_INTERRUPT_VECTORS)

#define ENABLE_INTERRUPTS	\
	do {	\
		__DMB();	\
		__enable_irq();	\
	} while (0)

#define DISABLE_INTERRUPTS	\
	do {	\
		__disable_irq();	\
		__DMB();	\
	} while (0)

#define HIGHEST_INTERRUPT_PRIORITY			0
#define HIGH_INTERRUPT_PRIORITY				1
#define NORMAL_INTERRUPT_PRIORITY			2
#define LOW_INTERRUPT_PRIORITY				3
#define LOWEST_INTERRUPT_PRIORITY			7
#define EVENT_LOOP_INTERRUPT_PRIORITY		LOWEST_INTERRUPT_PRIORITY

#define EVENT_THREAD_INTERRUPT		SWI0_EGU0_IRQn
#define SET_EVENT_PENDING				NVIC_SetPendingIRQ (EVENT_THREAD_INTERRUPT)

typedef struct PACK_STRUCTURE nrf52_oscillator {
	IO_CPU_CLOCK_SOURCE_STRUCT_MEMBERS
} nrf52_oscillator_t;

typedef struct nrf52_core_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
} nrf52_core_clock_t;

extern EVENT_DATA io_cpu_clock_implementation_t nrf52_on_chip_oscillator_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t nrf52_crystal_oscillator_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t nrf52_core_clock_implementation;

//
// to allow for secure peripherals one day
//
#define NRF_PERIPHERAL(P)			P

#include <nrf52_pins.h>
#include <nrf52_spi.h>
#include <nrf52_usarte.h>
#include <nrf52_qspi.h>
#include <nrf52_twi_master.h>
#include <nrf52_radio.h>

#ifdef IMPLEMENT_IO_CPU
//-----------------------------------------------------------------------------
//
// nrf52840 Implementtaion
//
//-----------------------------------------------------------------------------
#include <nrf/nrf52_sdk.h>

#define NFR_PERSISTANT_MEMORY_SECTION __attribute__ ((section(".io_config")))

/*
 *-----------------------------------------------------------------------------
 *
 * the initial io state settings
 *
 *-----------------------------------------------------------------------------
 */
static NFR_PERSISTANT_MEMORY_SECTION io_persistant_state_t ioc = {
	.first_run_flag = IO_FIRST_RUN_SET,
	.power_cycles = 0,
	.uid = {.bytes = {STATIC_UID}},
	.secret = {{0}},
	.shared = {{0}},
};

INLINE_FUNCTION void
wait_for_flash_ready (void) {
	while (NRF_NVMC->READYNEXT == 0);
}

static bool
io_erase_nvm_page (uint32_t *page_address) {
	if (NRF_NVMC->CONFIG == (NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos)) {

		//ENTER_CRITICAL_SECTION(io);
		
		// Enable erase.
		NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Een << NVMC_CONFIG_WEN_Pos);
		__ISB();
		__DSB();

		NRF_NVMC->ERASEPAGE = (uint32_t) page_address;
		wait_for_flash_ready ();
		
		// back to read only
		NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos);
		__ISB();
		__DSB();

		//EXIT_CRITICAL_SECTION(io);
		
		return true;
	} else {
		return false;
	}
}

static bool
io_write_nvm_page (uint32_t const *data,uint32_t num_words,uint32_t *write_address) {
	if (NRF_NVMC->CONFIG == (NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos)) {
		uint32_t i;

		//ENTER_CRITICAL_SECTION (io);
		
		// Enable erase.
		NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Een << NVMC_CONFIG_WEN_Pos);
		__ISB();
		__DSB();

		NRF_NVMC->ERASEPAGE = (uint32_t) write_address;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy);
		
		// Enable write.
		NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Wen << NVMC_CONFIG_WEN_Pos);
		__ISB();
		__DSB();

		for (i = 0; i < num_words; i++) {
			write_address[i] = data[i];
			wait_for_flash_ready();
		}
		
		// back to read only
		NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos);
		__ISB();
		__DSB();

		//EXIT_CRITICAL_SECTION (io);
		
		return true;
	} else {
		return false;
	}
}

void
io_generate_uid (io_t *io,io_uid_t *u) {
	u->words[0] = io_get_random_u32 (io);
	u->words[1] = io_get_random_u32 (io);
	u->words[2] = io_get_random_u32 (io);
	u->words[3] = io_get_random_u32 (io);
}

static bool
nrf52840_io_config_clear_first_run (io_t *io) {
	if (ioc.first_run_flag == IO_FIRST_RUN_SET) {
		io_persistant_state_t new_ioc = ioc;
		new_ioc.first_run_flag = IO_FIRST_RUN_CLEAR;

		#ifdef GENERATE_UID
		io_generate_uid (io,&new_ioc.uid);
		#endif
		
//		io_gererate_authentication_key_pair (io,&new_ioc.secret,&new_ioc.shared);
		
		io_erase_nvm_page ((uint32_t*) &ioc);
		io_write_nvm_page (
			io_config_u32_ptr(new_ioc),io_config_u32_size(),(uint32_t*) &ioc
		);
		return true;
	} else {
		return false;
	}
}

static bool
nrf52840_io_config_is_first_run (io_t *io) {
	bool first = (ioc.first_run_flag == IO_FIRST_RUN_SET);
	nrf52840_io_config_clear_first_run (io);
	return first;
}

static io_uid_t const*
nrf52840_io_config_uid (io_t *io) {
	return &ioc.uid;
}

//
// cpu clocks
//

static float64_t
nrf52_crystal_oscillator_get_current_frequency (io_cpu_clock_pointer_t this) {
	return 64000000.0;
}

static bool
nrf52_crystal_oscillator_start (io_t *io,io_cpu_clock_pointer_t this) {
	if (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {
		//
		// this also connects the clock to the CPU 
		// (i.e replaces the on-chip clock)
		//
		NRF_CLOCK->TASKS_HFCLKSTART    = 1;
		while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0);
	}
	return true;
}

EVENT_DATA io_cpu_clock_implementation_t nrf52_crystal_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = nrf52_crystal_oscillator_get_current_frequency,
	.start = nrf52_crystal_oscillator_start,
	.stop = NULL,
};

static float64_t
nrf52_on_chip_oscillator_get_current_frequency (io_cpu_clock_pointer_t this) {
	return 64000000.0;
}

static bool
nrf52_on_chip_oscillator_start (io_t *io,io_cpu_clock_pointer_t this) {
	return true;
}

EVENT_DATA io_cpu_clock_implementation_t nrf52_on_chip_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = nrf52_on_chip_oscillator_get_current_frequency,
	.start = nrf52_on_chip_oscillator_start,
	.stop = NULL,
};

static float64_t
nrf52_core_clock_get_current_frequency (io_cpu_clock_pointer_t clock) {
	nrf52_core_clock_t const *this = (nrf52_core_clock_t const*) (
		io_cpu_clock_ro_pointer (clock)
	);
	return io_cpu_clock_get_current_frequency (this->input);
}

static bool
nrf52_core_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		return true;
	} else {
		return false;
	}
}

