abstractsig/io_nrf52840/io_cpu.h
EVENT_DATA io_cpu_clock_implementation_t nrf52_core_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_current_frequency = nrf52_core_clock_get_current_frequency,
	.get_input = io_cpu_dependant_clock_get_input,
	.start = nrf52_core_clock_start,
	.stop = NULL,
};

//
// 64bit time clock
//
#define TIME_CLOCK_NS_PER_TICK		125LL

static void
nrf52_time_clock_interrupt (void *user_value) {
	nrf_64bit_time_clock_t *this = user_value;
	this->low_timer->EVENTS_COMPARE[0] = 0;
	io_enqueue_event (this->io,&this->alarm);
}

static uint64_t
read_64bit_count (nrf_64bit_time_clock_t *this) {
	io_time_t time = {0};

	do {
		this->low_timer->TASKS_CAPTURE[1] = 1;
		this->high_timer->TASKS_CAPTURE[1] = 1;
		
		time.part.low = this->low_timer->CC[1];
		time.part.high = this->high_timer->CC[1];
		this->high_timer->TASKS_CAPTURE[1] = 1;
	} while (time.part.high != this->high_timer->CC[1]);
	
	return time.u64;
}

static bool
set_64bit_time_clock_alarm_time (nrf_64bit_time_clock_t *this) {
	if (this->io->alarms != &s_null_io_alarm) {
		int64_t next_alarm_count = (
			this->io->alarms->when.nanoseconds / TIME_CLOCK_NS_PER_TICK
		);
		int64_t current_count = read_64bit_count (this) + 10000;

		if (next_alarm_count > current_count) {
			this->low_timer->CC[0] = next_alarm_count;
			return true;
		} else {
			// alarm is not in future
			return false;
		}
	} else {
		return false;
	}
}

static io_time_t
nrf_64bit_time_clock_get_time (nrf_64bit_time_clock_t *this) {
	return (io_time_t) {
		.nanoseconds = read_64bit_count(this) * TIME_CLOCK_NS_PER_TICK,
	};
}

static bool
process_next_alarm (nrf_64bit_time_clock_t *this) {
	if (this->io->alarms != &s_null_io_alarm) {
		volatile io_time_t t = nrf_64bit_time_clock_get_time (this);
		
		if (t.nanoseconds >= this->io->alarms->when.nanoseconds) {
			io_alarm_t *alarm = this->io->alarms;
			this->io->alarms = this->io->alarms->next_alarm;
			alarm->next_alarm = NULL;
			alarm->at->event_handler (alarm->at);
			
			//
			// tollerance check ...
			//
			return true;
		} else {
			//while(1) {}
		}
	}
	return false;
}

static void
process_alarm_queue (io_event_t *ev) {
	nrf_64bit_time_clock_t *this = ev->user_value;
	uint32_t count = 0;
	
	while (process_next_alarm(this)) {
		count++;
	}
	
	if (count) {
		set_64bit_time_clock_alarm_time (this);
	}
}

void
start_nrf_time_clock (io_t *io,nrf_64bit_time_clock_t *this) {

	this->io = io;
	initialise_io_event (&this->alarm,process_alarm_queue,this);

	register_io_interrupt_handler (
		this->io,this->interrupt_number,nrf52_time_clock_interrupt,this
	);

	this->high_timer->TASKS_STOP = 1;
	this->low_timer->TASKS_STOP = 1;

	this->high_timer->TASKS_CLEAR = 1;
	this->low_timer->TASKS_CLEAR = 1;

	this->high_timer->MODE = TIMER_MODE_MODE_Counter;
	this->high_timer->BITMODE = (
		TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos
	);

	this->low_timer->MODE = TIMER_MODE_MODE_Timer;
	this->low_timer->BITMODE = (
		TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos
	);
	this->low_timer->PRESCALER = 1;  // 125ns resolution

	// get high timer to count low timer roll-overs
	this->low_timer->CC[5] = 0xffffffff; // reduce count to test
	this->low_timer->SHORTS = (
		TIMER_SHORTS_COMPARE5_CLEAR_Enabled << TIMER_SHORTS_COMPARE5_CLEAR_Pos
	);

	NRF_PPI->CH[this->ppi_channel].EEP = (
		(uint32_t) &this->low_timer->EVENTS_COMPARE[5]
	);

	NRF_PPI->CH[this->ppi_channel].TEP = (
		(uint32_t) &this->high_timer->TASKS_COUNT
	);
	NRF_PPI->CHENSET = (1 << this->ppi_channel);

	this->low_timer->CC[0] = 0;	// a starter for 10

	this->low_timer->INTENSET = (
		TIMER_INTENSET_COMPARE0_Enabled << TIMER_INTENSET_COMPARE0_Pos
	);

	NVIC_SetPriority (this->interrupt_number,NORMAL_INTERRUPT_PRIORITY);
	NVIC_ClearPendingIRQ (this->interrupt_number);
	NVIC_EnableIRQ (this->interrupt_number);
	
	this->high_timer->TASKS_START = 1;
	this->low_timer->TASKS_START = 1;
}

static void
nrf_time_clock_enqueue_alarm (io_t *io,io_alarm_t *alarm) {
	nrf_64bit_time_clock_t *this = &((nrf52840_io_t*) io)->tc;
	
	ENTER_CRITICAL_SECTION(io);

	if (alarm->when.nanoseconds < this->io->alarms->when.nanoseconds) {
		alarm->next_alarm = this->io->alarms;
		this->io->alarms = alarm;
		if (!set_64bit_time_clock_alarm_time (this)) {
			io_panic (io,0);
		}
	} else {
		io_alarm_t *pre = this->io->alarms;
		while (alarm->when.nanoseconds > pre->when.nanoseconds) {
			if (pre->next_alarm == &s_null_io_alarm) {
				break;
			}
			pre = pre->next_alarm;
		}
		alarm->next_alarm = pre->next_alarm;
		pre->next_alarm = alarm;
	}

	EXIT_CRITICAL_SECTION(io);
}

static void
nrf_time_clock_dequeue_alarm (io_t *io,io_alarm_t *alarm) {
	if (alarm->next_alarm != NULL) {
		ENTER_CRITICAL_SECTION (io);
		if (alarm == io->alarms) {
			nrf_64bit_time_clock_t *this = &((nrf52840_io_t*) io)->tc;
			io->alarms = io->alarms->next_alarm;
			set_64bit_time_clock_alarm_time (this);
		} else {
			io_alarm_t *pre = io->alarms;
			while (pre) {
				if (alarm == pre->next_alarm) {
					pre->next_alarm = alarm->next_alarm;
					break;
				}
				pre = pre->next_alarm;
			}
		}
		alarm->next_alarm = NULL;
		EXIT_CRITICAL_SECTION (io);
	}
}

//
// needed for boards that use the 5V power setup
//
void
nrf_io_pin_voltage_setup (void) {
	if (
			(NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk)
		==	(UICR_REGOUT0_VOUT_DEFAULT << UICR_REGOUT0_VOUT_Pos)
	) {
		NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

		NRF_UICR->REGOUT0 = (
				(NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk))
			|	(UICR_REGOUT0_VOUT_3V0 << UICR_REGOUT0_VOUT_Pos)
		);

		NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

		// System reset is needed to update UICR registers.
		NVIC_SystemReset();
	}
}

void
nrf52_configure_reset_pin (nrf_io_pin_t reset_pin) {
	if ((NRF_UICR->PSELRESET[0] & 0x3f) == 0x3f) {
		NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

		NRF_UICR->PSELRESET[0] = (
				(UICR_PSELRESET_CONNECT_Connected << UICR_PSELRESET_CONNECT_Pos)
			|	nrf_gpio_pin_map (reset_pin)
		);
		NRF_UICR->PSELRESET[1] = (
				(UICR_PSELRESET_CONNECT_Connected << UICR_PSELRESET_CONNECT_Pos)
			|	nrf_gpio_pin_map (reset_pin)
		);
		
