abstractsig/io_nrf52840/io_cpu.h
		NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
		while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
	}
}

//
// Io
//
static io_byte_memory_t*
nrf52_io_get_byte_memory (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	return this->bm;
}

static io_value_memory_t*
nrf52_io_get_stvm (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	return this->vm;
}

static void
nrf52_do_gc (io_t *io,int32_t count) {
	io_value_memory_do_gc (io_get_short_term_value_memory (io),count);
}

static void
nrf52_signal_event_pending (io_t *io) {
	SET_EVENT_PENDING;
}

static void
nrf52_panic (io_t *io,int code) {
	DISABLE_INTERRUPTS;
	while (1);
}

static bool
nrf52_enter_critical_section (io_t *env) {
	uint32_t interrupts_are_enabled = !(__get_PRIMASK() & 0x1);
	DISABLE_INTERRUPTS;
	return interrupts_are_enabled;
}

void
nrf52_exit_critical_section (io_t *env,bool were_enabled) {
	if (were_enabled) {
		ENABLE_INTERRUPTS;
	}
}

static uint32_t
nrf52840_get_random_u8 (void) {	
	NRF_RNG->EVENTS_VALRDY = 0;
	while (NRF_RNG->EVENTS_VALRDY == 0);	
	return NRF_RNG->VALUE;
}

static uint32_t
nrf52840_get_random_u32 (void) {
	uint32_t r = nrf52840_get_random_u8();
	r <<= 8;
	r += nrf52840_get_random_u8();
	r <<= 8;
	r += nrf52840_get_random_u8();
	r <<= 8;
	r += nrf52840_get_random_u8();
	return r;
}

static uint32_t
nrf52_get_random_u32 (io_t *io) {
	uint32_t r;
	
	bool h = enter_io_critical_section (io);
	
	r = nrf52840_get_random_u32 ();

	exit_io_critical_section (io,h);

	return r;
}

INLINE_FUNCTION uint32_t prbs_rotl(const uint32_t x, int k) {
	return (x << k) | (x >> (32 - k));
}

static uint32_t
nrf52_get_prbs_random_u32 (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	uint32_t *s = this->prbs_state;
	bool h = enter_io_critical_section (io);
	const uint32_t result = prbs_rotl (s[0] + s[3], 7) + s[0];

	const uint32_t t = s[1] << 9;

	s[2] ^= s[0];
	s[3] ^= s[1];
	s[1] ^= s[2];
	s[0] ^= s[3];

	s[2] ^= t;

	s[3] = prbs_rotl (s[3], 11);

	exit_io_critical_section (io,h);
	return result;
}

static void
wait_for_all_events (io_t *io) {
	io_event_t *event;
	io_alarm_t *alarm;
	do {
		ENTER_CRITICAL_SECTION(io);
		event = io->events;
		alarm = io->alarms;
		EXIT_CRITICAL_SECTION(io);
	} while (
			event != &s_null_io_event
		&&	alarm != &s_null_io_alarm
	);
}

static void
nrf52_log (io_t *io,char const *fmt,va_list va) {

}

static bool
nrf52_is_in_event_thread (io_t *io) {
	return ((nrf52840_io_t*) io)->in_event_thread;
}

static void
nrf52_wait_for_event (io_t *io) {
	__WFI();
}

static io_interrupt_handler_t cpu_interrupts[NUMBER_OF_INTERRUPT_VECTORS];

static void
null_interrupt_handler (void *w) {
	while(1);
}

static void	
nrf52_register_interrupt_handler (
	io_t *io,int32_t number,io_interrupt_action_t handler,void *user_value
) {
	io_interrupt_handler_t *i = (
		cpu_interrupts + number + NUMBER_OF_ARM_INTERRUPT_VECTORS
	);
	i->action = handler;
	i->user_value = user_value;
}

static bool	
nrf52_unregister_interrupt_handler (
	io_t *io,int32_t number,io_interrupt_action_t handler
) {
	io_interrupt_handler_t *i = (
		cpu_interrupts + number + NUMBER_OF_ARM_INTERRUPT_VECTORS
	);
	if (i->action == handler) {
		i->action = null_interrupt_handler;
		i->user_value = io;
		return true;
	} else {
		return false;
	}
}
static void
nrf52_signal_task_pending (io_t *io) {
	// no action required
}

static bool
nrf52_enqueue_task (io_t *io,vref_t r_task) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	return io_value_pipe_put_value (this->tasks,r_task);
}

static bool
nrf52_do_next_task (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	vref_t r_task;
	if (io_value_pipe_get_value (this->tasks,&r_task)) {
		vref_t const *argv;
		uint32_t argc;
		
		if (io_vector_value_get_values (r_task,&argc,&argv)) {
			
			// ...
		
			return true;
		}
	}
	return false;
}

static io_time_t
nrf52_get_time (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	return nrf_64bit_time_clock_get_time (&this->tc);
}

static bool
nrf52840_is_first_run (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	return this->first_run;
}

void
add_io_implementation_cpu_methods (io_implementation_t *io_i) {
	add_io_implementation_core_methods (io_i);

	io_i->is_first_run = nrf52840_is_first_run;
	io_i->uid = nrf52840_io_config_uid;
	io_i->get_byte_memory = nrf52_io_get_byte_memory;
	io_i->get_short_term_value_memory = nrf52_io_get_stvm;
	io_i->do_gc = nrf52_do_gc;
	io_i->get_random_u32 = nrf52_get_random_u32;
	io_i->get_next_prbs_u32 = nrf52_get_prbs_random_u32;
	io_i->signal_task_pending = nrf52_signal_task_pending;
	io_i->enqueue_task = nrf52_enqueue_task;
	io_i->do_next_task = nrf52_do_next_task;
	io_i->signal_event_pending = nrf52_signal_event_pending;
	io_i->enter_critical_section = nrf52_enter_critical_section;
	io_i->exit_critical_section = nrf52_exit_critical_section;
	io_i->in_event_thread = nrf52_is_in_event_thread;
	io_i->wait_for_event = nrf52_wait_for_event;
	io_i->get_time = nrf52_get_time,
	io_i->enqueue_alarm = nrf_time_clock_enqueue_alarm;
	io_i->dequeue_alarm = nrf_time_clock_dequeue_alarm;
	io_i->register_interrupt_handler = nrf52_register_interrupt_handler;
	io_i->unregister_interrupt_handler = nrf52_unregister_interrupt_handler;
	io_i->wait_for_all_events = wait_for_all_events;

	io_i->set_io_pin_output = nrf52_set_io_pin_to_output,
	io_i->set_io_pin_input = nrf52_set_io_pin_to_input,
	io_i->set_io_pin_interrupt = nrf52_set_io_pin_interrupt,
	io_i->set_io_pin_alternate = io_pin_nop,
	io_i->read_from_io_pin = nrf52_read_io_input_pin,
	io_i->write_to_io_pin = nrf52_write_to_io_pin,
	io_i->toggle_io_pin = nrf52_toggle_io_pin,
	io_i->valid_pin = nrf52_io_pin_is_valid,

	io_i->log = nrf52_log;
	io_i->panic = nrf52_panic;
}

static void
event_thread (void *io) {
	nrf52840_io_t *this = io;
	this->in_event_thread = true;
	while (next_io_event (io));
	this->in_event_thread = false;
}

void
initialise_cpu_io (io_t *io) {
	nrf52840_io_t *this = (nrf52840_io_t*) io;
	this->in_event_thread = false;
	this->first_run = nrf52840_io_config_is_first_run(io);
	register_io_interrupt_handler (
		io,EVENT_THREAD_INTERRUPT,event_thread,io
	);
	NVIC_EnableIRQ (EVENT_THREAD_INTERRUPT);
	
	start_nrf_time_clock (io,&this->tc);

